{
	"id": 1,
	"chef_name": "Carlos Gomez",
	"chef_picture": "https://images.unsplash.com/photo-1512485800893-b08ec1ea59b1?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1170&q=80",
	"short_bio": "Chef Carlos Gomez is a Mexican-born chef who has been cooking professionally for over 20 years.",
	"experience": "Chef Carlos Gomez has worked at several high-end restaurants in Mexico and the United States, where he has honed his skills in Mexican cuisine.",
	"likes": 12000,
	"num_recipes": 4,
	"recipes": [
		{
			"recipe_name": "Chiles en Nogada",
			"recipe_picture": "https://mexicanfoodjournal.com/wp-content/uploads/2016/09/Chile-en-Nogada.jpg",
			"ingredients": [
				"6 poblano chiles",
				"1/2 cup diced onion",
				"1/2 cup diced tomato",
				"1/4 cup raisins",
				"1/4 cup chopped almonds",
				"Salt and pepper to taste",
				"1/2 cup flour",
				"3 eggs",
				"1 cup breadcrumbs",
				"2 cups vegetable oil"
			],
			"cooking_method": [
				"Roast the poblano chiles over an open flame until blackened on all sides.",
				"Transfer the chiles to a plastic bag and let them steam for 15 minutes.",
				"Remove the skins, stems, and seeds from the chiles.",
				"Stir in the raisins, almonds, walnuts, apple, pear, peach, parsley, cinnamon, clove, nutmeg, cumin, salt, and pepper.",
				"Cook for 10 minutes, stirring occasionally.",
				"Fill each poblano chile with the pork mixture.",
				"Roll each stuffed chile in flour, dip it in beaten eggs, and coat it with breadcrumbs.",
				"Heat the vegetable oil in a large skillet over medium heat.",
				"Fry the chiles until golden brown on all sides.",
				"For the sauce, blend the sour cream, walnuts, milk, sugar, and vinegar in a blender until smooth.",
				"Serve the chiles en nogada with the walnut sauce and crumbled queso fresco."
			],
			"rating": 4.5
		},
		{
			"recipe_name": "Carnitas Tacos",
			"recipe_picture": "https://whatsgabycooking.com/wp-content/uploads/2019/03/All-Clad-__-Carnitas-Tacos-580x870-1.jpg",
			"ingredients": [
				"1 tsp cumin",
				"1 tsp chili powder",
				"1 tsp oregano",
				"1 tsp garlic powder",
				"1 tsp onion powder",
				"1/2 tsp salt",
				"1/4 tsp black pepper",
				"Corn tortillas",
				"Cilantro",
				"Onion",
				"Lime wedges"
			],
			"cooking_method": [
				"In a large Dutch oven or heavy-bottomed pot, combine the pork, orange juice, water, cumin, chili powder, oregano, garlic powder, onion powder, salt, and black pepper.",
				"Bring the mixture to a boil over high heat, then reduce the heat to low and simmer for 2-3 hours, stirring occasionally.",
				"When the pork is tender and falling apart, use a slotted spoon to transfer it to a baking sheet.",
				"Preheat the broiler to high.",
				"Arrange the shredded pork in a single layer on the baking sheet.",
				"Fill each tortilla with a spoonful of carnitas, and top with chopped cilantro and onion.",
				"Serve with lime wedges."
			],
			"rating": 4.8
		},
		{
			"recipe_name": "Chiles Rellenos",
			"recipe_picture": "https://www.goya.com/media/4255/stuffed-chileschiles-rellenos.jpg?quality=80",
			"ingredients": [
				"4 poblano peppers",
				"1 lb ground beef",
				"1/2 onion, chopped",
				"2 garlic cloves, minced",
				"1 tsp cumin",
				"1 tsp chili powder",
				"1 tsp dried oregano",
				"1/2 tsp salt",
				"1/4 tsp black pepper",
				"1 cup shredded cheese",
				"2 eggs",
				"1/4 cup all-purpose flour",
				"Vegetable oil",
				"Salsa, for serving"
			],
			"cooking_method": [
				"Preheat the oven to 350°F.",
				"Roast the poblano peppers on a baking sheet for 20-25 minutes, or until the skins are blistered and charred.",
				"Remove the peppers from the oven and transfer them to a large bowl.",
				"Cover the bowl with plastic wrap and let the peppers steam for 10-15 minutes, or until the skins are loosened.",
				"Separate the egg yolks from the whites and beat the whites until stiff peaks form.",
				"In a separate bowl, beat the yolks until light and fluffy.",
				"Gently fold the yolks into the whites, then fold in the flour.",
				"Heat 1/4 inch of oil in a large skillet over medium heat.",
				"Dip each stuffed pepper in the egg mixture, then carefully place it in the hot oil.",
				"Fry the peppers for 2-3 minutes per side, or until golden brown.",
				"Serve with salsa."
			],
			"rating": 4.5
		}
	]
}
